
## Plan Result




<pre><code>Plan: 15 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;groupid-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;request-video-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;retrieve-video-hearing-by-user&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;retrieve-video-hearings&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;update-video-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;groupid-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;request-video-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;retrieve-video-hearing-by-user&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;retrieve-video-hearings&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-video-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;groupid-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;request-video-hearing&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;retrieve-video-hearing-by-user&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;retrieve-video-hearings&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag[&#34;update-video-hearing&#34;]
* Update
  * module.api_mgmt_product.azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/hmi-product-stg"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["groupid-hearing"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Groupid Hearing"
      + display_name        = "Groupid Hearing"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "groupid-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/hearings/{groupId}/hearings"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Accept"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }

      + template_parameter {
          + name     = "groupId"
          + required = true
          + type     = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["request-video-hearing"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Request Video Hearing"
      + display_name        = "Request Video Hearing"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "request-video-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/resources/video-hearing"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 201
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["retrieve-video-hearing-by-user"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Retrieve Video Hearing By User"
      + display_name        = "Retrieve Video Hearing By User"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "retrieve-video-hearing-by-user"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/resources/video-hearing"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }

          + query_parameter {
              + name     = "username"
              + required = false
              + type     = "string"
            }
        }

      + response {
          + status_code = 200
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["retrieve-video-hearings"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Retrieve Video Hearings"
      + display_name        = "Retrieve Video Hearings"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "retrieve-video-hearings"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/resources/video-hearing/{hearingId}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }

      + template_parameter {
          + default_value = "VH012"
          + name          = "hearingId"
          + required      = true
          + type          = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-video-hearing"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + description         = "Update Video Hearing"
      + display_name        = "Update Video Hearing"
      + id                  = (known after apply)
      + method              = "PUT"
      + operation_id        = "update-video-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/resources/video-hearing/{hearingId}"

      + request {
          + header {
              + default_value = "CFT"
              + name          = "Source-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "MOCK"
              + name          = "Destination-System"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "2019-10-12T07:20:00Z"
              + name          = "Request-Created-At"
              + required      = true
              + type          = "string"
            }
          + header {
              + default_value = "application/json"
              + name          = "Content-Type"
              + required      = true
              + type          = "string"
            }
        }

      + response {
          + status_code = 200
        }

      + template_parameter {
          + default_value = "VH1234"
          + name          = "hearingId"
          + required      = true
          + type          = "string"
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["groupid-hearing"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "groupid-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["request-video-hearing"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "request-video-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["retrieve-video-hearing-by-user"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "retrieve-video-hearing-by-user"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["retrieve-video-hearings"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "retrieve-video-hearings"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-video-hearing"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-apim"
      + id                  = (known after apply)
      + operation_id        = "update-video-hearing"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = (sensitive value)
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["groupid-hearing"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["request-video-hearing"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["retrieve-video-hearing-by-user"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["retrieve-video-hearings"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

  # module.apim_apis.azurerm_api_management_api_operation_tag.apim_api_tag["update-video-hearing"] will be created
  + resource "azurerm_api_management_api_operation_tag" "apim_api_tag" {
      + api_operation_id = (known after apply)
      + display_name     = "video-hearings"
      + id               = (known after apply)
      + name             = "video-hearings"
    }

Plan: 15 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Vars":{}} -->